app/views/assignments/show.html.erb

  <strong>Course:</strong>
  <%=
    @course = Course.find(@assignment.course_id)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]