app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT "assignments".* FROM "assignments"