app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments" WHERE (course_id = '2')
---
  def index
    #select only the records for the given course param.
    @assignments = Assignment.where("course_id = ?", params[:course_id])

SELECT "courses".* FROM "courses" WHERE (user_id = 3)
---
  def new
    # <%= collection_select(:course, :course_id, @courses, :id, :class_name, options ={:prompt => "- Select a Course -"}, :class =>"course") %>
    # Construct a list of Courses that the current user has created.
    # TODO: add logic to check if @courses is nil - if so, redirect them to create a course with notice of you must first create a course!
    @courses = Course.where("user_id = ?", session[:user_id])

SELECT "courses".* FROM "courses" WHERE (user_id = 3)
---
  def edit
    @courses = Course.where("user_id = ?", session[:user_id])

INSERT INTO "assignments" ("assignment_name", "course_id", "created_at", "date_due", "details", "grade_received", "is_complete", "priority", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # Build the new Assignemnt object.
    selected_course = params[:select_course]
    @assignment = Assignment.new(assignment_params)
    @assignment.course_id = selected_course

    # Save.
    if @assignment.save

UPDATE "assignments" SET "is_complete" = ?, "grade_received" = ?, "updated_at" = ? WHERE "assignments"."id" = 5  [["is_complete", true], ["grade_received", 98], ["updated_at", Thu, 17 Apr 2014 20:50:44 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @assignment.update(assignment_params)

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_assignment
      @assignment = Assignment.find(params[:id])