app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (user_id = 3)
SELECT COUNT(*) FROM "courses" WHERE (user_id = 3)
---
  def index
    if session[:user_id].nil?
      redirect('/')
    end

    #@courses = Course.all
    #select only the records for this user
    @courses = Course.where("user_id = ?", session[:user_id])
    #displays message if no courses have been added yet
    if @courses.empty?

INSERT INTO "courses" ("class_name", "course_number", "created_at", "details", "teacher_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save