app/controllers/exams_controller.rb

  def new
    # Construct a list of Courses that the current user has created.
    # TODO: add logic to check if @courses is nil - if so, redirect them to create a course with notice of you must first create a course!
    @courses = Course.where("user_id = ?", session[:user_id])
---
SELECT "courses".* FROM "courses" WHERE (user_id = 8)

  def edit
    @courses = Course.where("user_id = ?", session[:user_id])
---
SELECT "courses".* FROM "courses" WHERE (user_id = 8)

  def create
    # Build the new Exam object.
    selected_course = params[:select_course]
    @exam = Exam.new(exam_params)
    @exam.course_id = selected_course


    # Save.
    if @exam.save
---
INSERT INTO "exams" ("comments", "course_id", "created_at", "date_created", "date_of_exam", "details", "exam_id", "exam_name", "grade_received", "is_complete", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_exam
      @exam = Exam.find(params[:id])
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "3"]]